using System.Collections.Generic;

namespace TradePlatform.StockDataDownload.DataServices.SecuritiesInfo.Finam
{
    internal static class FinamMarketHelper
    {
        public static readonly Dictionary<string, string> Markets = new Dictionary<string, string>()
            {
                { "200", "МосБиржа топ" },

                { "1", "МосБиржа акции" },

                { "14", "МосБиржа фьючерсы" },

                { "41", "Курс рубля" },

                { "45", "МосБиржа валютный рынок" },

                { "2", "МосБиржа облигации" },

                { "12", "МосБиржа внесписочные облигации" },

                { "29", "МосБиржа пифы" },

                { "515", "Мосбиржа ETF" },

                { "8", "Расписки" },

                { "519", "Еврооблигации" },

                { "517", "Санкт-Петербургская биржа" },

                { "6", "Мировые Индексы" },

                { "24", "Товары" },

                { "5", "Мировые валюты" },

                { "25", "Акции США(BATS)" },

                { "7", "Фьючерсы США" },

                { "27", "Отрасли экономики США" },

                { "26", "Гособлигации США" },

                { "28", "ETF" },

                { "30", "Индексы мировой экономики" },

                { "91", "Российские индексы" },

                { "3", "РТС" },

                { "20", "RTS Board" },

                { "10", "РТС-GAZ" },

                { "17", "ФОРТС Архив" },

                { "31", "Сырье Архив" },

                { "38", "RTS Standard Архив" },

                { "16", "ММВБ Архив" },

                { "18", "РТС Архив" },

                { "9", "СПФБ Архив" },

                { "32", "РТС-BOARD Архив" },

                { "39", "Расписки Архив" },

                { "-1", "Отрасли" }
            };
    }
}
